Json/calcmul.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Multiply>
         <tem:intA>8</tem:intA>
         <tem:intB>9</tem:intB>
      </tem:Multiply>
   </soapenv:Body>
</soapenv:Envelope>