RestAssuredAutomation/SoapMultiplyRequest/multiply.XML

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Multiply xmlns="http://tempuri.org/">
            <intA>2</intA>
            <intB>3</intB>
        </Multiply>
    </Body>
</Envelope>