resources/divide.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Divide>
         <tem:intA>36</tem:intA>
         <tem:intB>6</tem:intB>
      </tem:Divide>
   </soapenv:Body>
</soapenv:Envelope> 