target/classes/SubReq.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope/" xmlns:tem="http://tempuri.org/">
    <soap:Header/>
    <soap:Body>
        <tem:Subtract>
            <tem:intA>100</tem:intA>
            <tem:intB>10</tem:intB>
        </tem:Subtract>
    </soap:Body>

</soap:Envelope>