Test1/Variables/SOAPRequests/Temp.xml

<?xml version='1.0' encoding='UTF-8'?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
   <Header />
   <Body>
      <Add xmlns="http://tempuri.org/">
         <intA>10</intA>
         <intB>15</intB>
      </Add>
   </Body>
</Envelope>