src/test/resources/API Logs/this-feature-is-to-check-webservice-testing/Check if user is able to submit API request and Checks The Status Code for SOAP OperationFor the Webservice_Post_DIVIDE2020-08-09 17_ 12_ 38_707.txt

-----------------------Reading testcase for Webservice_Post_DIVIDE in the Sheet Getdata--------------------------
-----------------------Getting Request data--------------------------
Request method:	POST
Request URI:	http://www.dneonline.com/calculator.asmx
Proxy:			<none>
Request params:	<none>
Query params:	<none>
Form params:	<none>
Path params:	<none>
Headers:		Accept=*/*
				Content-Type=text/xml; charset=ISO-8859-1
Cookies:		<none>
Multiparts:		<none>
Body:
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Divide xmlns="http://tempuri.org/">
      <intA>40</intA>
      <intB>10</intB>
    </Divide>
  </soap:Body>
</soap:Envelope>
-----------------------Getting Response data--------------------------
HTTP/1.1 200 OK
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Encoding: gzip
Vary: Accept-Encoding
Server: Microsoft-IIS/7.5
X-AspNet-Version: 2.0.50727
X-Powered-By: ASP.NET
Date: Sun, 09 Aug 2020 11:42:34 GMT
Content-Length: 300

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <DivideResponse xmlns="http://tempuri.org/">
      <DivideResult>4</DivideResult>
    </DivideResponse>
  </soap:Body>
</soap:Envelope>

-----------------------Closing testcase for Webservice_Post_DIVIDE in the Sheet Getdata--------------------------